# YOLOv8-P2: 增加 P2 检测头，针对小尺度行人优化
# Stride: [4, 8, 16, 32] -> 特征图: [160x160, 80x80, 40x40, 20x20]
# 附加: P2/P3 级别 Concat 后接 Coordinate Attention，增强小目标位置感知

# Parameters
nc: 1 # 针对行人系统建议设为 1
scales:
  s: [0.33, 0.50, 1024] # 以 s 版本为例

# YOLOv8 backbone

backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2  <-- P2 特征图 (160x160)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]  # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8 neck & head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (P4 level)
  - [[-1, 6], 1, Concat, [1]]                  # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                        # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (P3 level)
  - [[-1, 4], 1, Concat, [1]]                  # 14 cat backbone P3
  - [-1, 3, C2f, [256]]                        # 15
  - [-1, 1, CoordAtt, []]                      # 16  ← Coordinate Attention (P3)

  # --- P2 小尺度检测层 (160x160) ---

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 (P2 level)
  - [[-1, 2], 1, Concat, [1]]                  # 18 连接 backbone 第 2 层 (stride 4)
  - [-1, 3, C2f, [128]]                        # 19 (P2 输出特征, 160x160)
  - [-1, 1, CoordAtt, []]                      # 20  ← Coordinate Attention (P2)

  - [-1, 1, Conv, [128, 3, 2]]                 # 21 (降采样回 P3)
  - [[-1, 16], 1, Concat, [1]]                 # 22 cat head P3
  - [-1, 3, C2f, [256]]                        # 23 (P3 输出)

  - [-1, 1, Conv, [256, 3, 2]]                 # 24 (降采样回 P4)
  - [[-1, 12], 1, Concat, [1]]                 # 25 cat head P4
  - [-1, 3, C2f, [512]]                        # 26 (P4 输出)

  - [-1, 1, Conv, [512, 3, 2]]                 # 27 (降采样回 P5)
  - [[-1, 9], 1, Concat, [1]]                  # 28 cat head P5
  - [-1, 3, C2f, [1024]]                       # 29 (P5 输出)

  # 最终检测层：接收 4 个尺度的输入
  - [[20, 23, 26, 29], 1, Detect, [nc]]        # Detect(P2, P3, P4, P5)
