# YOLOv8-P2: 增加 P2 检测头，针对小尺度行人优化
# Stride: [4, 8, 16, 32] -> 特征图: [160x160, 80x80, 40x40, 20x20]
# 附加: P2/P3 级别 C2f 融合后接 Coordinate Attention，增强小目标位置感知
# 附加: 基于BiFPN特征融合加权与C2f_DCNv2（深层）对抗遮挡

# Parameters
nc: 1 # 针对行人系统建议设为 1
scales: # model compound scaling constants, i.e. 'model=yolov8n-p2.yaml' will call yolov8-p2.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]  # 2  <-- P2 特征图 (160x160)
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]  # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_DCNv2, [512, True]]  # 6 深层DCNv2
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_DCNv2, [1024, True]] # 8 深层DCNv2
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8 neck & head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10 (P4 level)
  - [[-1, 6], 1, BiFPN_Concat, [1]]            # 11 cat backbone P4
  - [-1, 3, C2f, [512]]                        # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 (P3 level)
  - [[-1, 4], 1, BiFPN_Concat, [1]]            # 14 cat backbone P3
  - [-1, 1, CoordAtt, []]                      # 15  ← CA 放在 C2f 前 (P3)
  - [-1, 3, C2f, [256]]                         # 16  (CA处理后特征提取)

  # --- P2 小尺度检测层 (160x160) ---

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17 (P2 level)
  - [[-1, 2], 1, BiFPN_Concat, [1]]            # 18 连接 backbone 第 2 层 (stride 4)
  - [-1, 1, CoordAtt, []]                      # 19  ← CA 放在 C2f 前 (P2, 160x160)
  - [-1, 3, C2f, [128]]                         # 20  (CA处理后特征提取)

  - [-1, 1, Conv, [128, 3, 2]]                 # 21 (降采样回 P3)
  - [[-1, 16], 1, BiFPN_Concat, [1]]           # 22 cat head P3
  - [-1, 3, C2f, [256]]                        # 23 (P3 输出)

  - [-1, 1, Conv, [256, 3, 2]]                 # 24 (降采样回 P4)
  - [[-1, 12], 1, BiFPN_Concat, [1]]           # 25 cat head P4
  - [-1, 3, C2f, [512]]                        # 26 (P4 输出)

  - [-1, 1, Conv, [512, 3, 2]]                 # 27 (降采样回 P5)
  - [[-1, 9], 1, BiFPN_Concat, [1]]            # 28 cat head P5
  - [-1, 3, C2f, [1024]]                       # 29 (P5 输出)

  # 最终检测层：接收 4 个尺度的输入
  - [[20, 23, 26, 29], 1, Detect, [nc]]        # Detect(P2, P3, P4, P5)
